%离散时间系统，因为时间是离散的，
%所以相对于连续时间系统少了时间离散化过程，直接写时间点数N

%仿真点数
clear;
N=5;

%输入信号，单位数字冲激函数
f=[1,zeros(1,N-1)];

%状态变量函数，及初始化
x=zeros(2,N+1);
x(:,1)=[0;0];%x的第一列赋值为 0

%递推计算
for n=1:N
   x(1,n+1)=-0.5.*(x(1,n)+f(n));
   x(2,n+1)=f(n);
   y(n)=x(1,n+1)+x(2,n+1)+f(n);
end

%图形显示（离散时间系统，使用茎状图）
t_n=0:N-1;
subplot(4,1,1);stem(t_n,f);axis([-1 N 0 1.5]);
subplot(4,1,2);stem(t_n,x(1,1:N));axis([-1 N -0.6 0.5]);
subplot(4,1,3);stem(t_n,x(2,1:N));axis([-1 N 0 1.5]);
subplot(4,1,4);stem(t_n,y);axis([-1 N -0.5 2]);